[
  {
    "day": 1,
    "text": "O vjernici! Propisano vam je da postite, kao što je bilo propisano onima prije vas, da biste bogobojazni bili.",
    "reference": "(Kur'an 2:183)"
  },
  {
    "day": 2,
    "text": "Mjesec ramazan u kojem je objavljen Kur'an - uput ljudima, razjašnjenje uputa i razlikovanje istine od laži.",
    "reference": "(Kur'an 2:185)"
  },
  {
    "day": 3,
    "text": "I jedi i pij dok ne postane jasna razlika između bijele i crne niti u zoru, a zatim posti do noći!",
    "reference": "(Kur'an 2:187)"
  },
  {
    "day": 4,
    "text": "On je nebesa i Zemlju stvorio po istini, a kada kaže: 'Neka bude!', - ono biva.",
    "reference": "(Kur'an 6:73)"
  },
  {
    "day": 5,
    "text": "Allah je onaj koji je objavio Knjigu istinito i pravo mjerilo.",
    "reference": "(Kur'an 42:17)"
  },
  {
    "day": 6,
    "text": "I kad te robovi Moji za Mene pitaju, ti im odgovori da sam Ja blizu; molbu uslišim onoga koji Mene moli kad Me zamoli.",
    "reference": "(Kur'an 2:186)"
  },
  {
    "day": 7,
    "text": "Zaista, Allah voli one koji se pokaju i voli one koji se čiste.",
    "reference": "(Kur'an 2:222)"
  },
  {
    "day": 8,
    "text": "O vjernici! Tražite pomoć u strpljivosti i namazu! Allah je, zaista, uz strpljive!",
    "reference": "(Kur'an 2:153)"
  },
  {
    "day": 9,
    "text": "On je nebesa i Zemlju mudro stvorio, a noć oko dana i dan oko noći obmotava.",
    "reference": "(Kur'an 39:5)"
  },
  {
    "day": 10,
    "text": "I sjećajte se Mene, i Ja ću se sjetiti vas; budite Mi zahvalni i ne budite Mi nezahvalni!",
    "reference": "(Kur'an 2:152)"
  },
  {
    "day": 11,
    "text": "Gospodar nas naš jeste Allah koji je svakom stvoru oblik dao pa ga uputio.",
    "reference": "(Kur'an 20:50)"
  },
  {
    "day": 12,
    "text": "On je nebesa i Zemlju u šest dana stvorio, a zatim se popeo na Arš.",
    "reference": "(Kur'an 57:4)"
  },
  {
    "day": 13,
    "text": "Zaista, nakon teškoće dolazi olakšanje.",
    "reference": "(Kur'an 94:6)"
  },
  {
    "day": 14,
    "text": "I narod tvoj neka na dobro poziva, i neka zapovijeda dobro činiti i zabranjuje zlo raditi.",
    "reference": "(Kur'an 3:104)"
  },
  {
    "day": 15,
    "text": "O vi koji vjerujete! Budite Allah­ovi pomagači!",
    "reference": "(Kur'an 61:14)"
  },
  {
    "day": 16,
    "text": "I borci koji se bore na Allahovu putu, oni koji svoj imetak i život žrtvuju - oni su najveći.",
    "reference": "(Kur'an 9:20)"
  },
  {
    "day": 17,
    "text": "Allah vas je podržao na Bedru kada ste bili slabi, zato se bojte Allaha da biste zahvalni bili!",
    "reference": "(Kur'an 3:123)"
  },
  {
    "day": 18,
    "text": "Mi ćemo ih, doista, pokazati puteve Naše onima koji se budu zbog Nas borili.",
    "reference": "(Kur'an 29:69)"
  },
  {
    "day": 19,
    "text": "O vi koji vjerujete! Ne gubite nadu u Allahovu milost, jer u Allahovu milost gubi nadu samo narod nevjernika.",
    "reference": "(Kur'an 12:87)"
  },
  {
    "day": 20,
    "text": "A posljednjih deset dana ramazana, Vjerovjesnik je provodio u džamiji u ibadetu.",
    "reference": "(Hadis)"
  },
  {
    "day": 21,
    "text": "Spominji ime Gospodara svoga i posvetise Njemu potpuno!",
    "reference": "(Kur'an 73:8)"
  },
  {
    "day": 22,
    "text": "Noć je to u kojoj se spušta svaki mudri posao.",
    "reference": "(Kur'an 44:4)"
  },
  {
    "day": 23,
    "text": "Doista, Mi smo ga objavili u Noći moći.",
    "reference": "(Kur'an 97:1)"
  },
  {
    "day": 24,
    "text": "A šta te učinilo da znaš šta je Noć moći?",
    "reference": "(Kur'an 97:2)"
  },
  {
    "day": 25,
    "text": "Noć moći je bolja od hiljadu mjeseci!",
    "reference": "(Kur'an 97:3)"
  },
  {
    "day": 26,
    "text": "U njoj se spuštaju meleki i Džibril, s dozvolom Gospodara svoga radi svakog posla.",
    "reference": "(Kur'an 97:4)"
  },
  {
    "day": 27,
    "text": "Mir je to sve do zore!",
    "reference": "(Kur'an 97:5)"
  },
  {
    "day": 28,
    "text": "Zaista je uzvišen onaj koji se oplemeni, koji se sjeti imena Gospodara svoga i klanja namaz!",
    "reference": "(Kur'an 87:14-15)"
  },
  {
    "day": 29,
    "text": "I spomni ime Gospodara svoga ujutro i uvečer!",
    "reference": "(Kur'an 76:25)"
  },
  {
    "day": 30,
    "text": "On je nebesa i Zemlju mudro stvorio, i On vam obličje daje, i lijepo ga stvara, i Njemu je povratak!",
    "reference": "(Kur'an 64:3)"
  }
]
